book/working-with-data-in-python.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-14 Tue 05:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Working With Data in Python</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Working With Data in Python</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7c0a24a">1. Working with Data Python</a>
<ul>
<li><a href="#orgb8530d4">1.1. Some additional sources</a>
<ul>
<li><a href="#org90b4806">1.1.1. Pandas Books</a></li>
<li><a href="#orgce59f2c">1.1.2. Blogs</a></li>
</ul>
</li>
<li><a href="#orgc374781">1.2. Data handling in Python</a>
<ul>
<li><a href="#org84db6e6">1.2.1. Pandas</a></li>
<li><a href="#org29cc7d1">1.2.2. Interactve Pandas</a></li>
<li><a href="#orgc353eda">1.2.3. Getting Your Data Into Python</a></li>
<li><a href="#org348ea0f">1.2.4. Repeating Things We Did In R With Pandas</a></li>
<li><a href="#org5b2e734">1.2.5. Functional Styles versus Object Orientation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd83dee9">2. Assessing Your Use of Pandas</a>
<ul>
<li><a href="#orga5e6c87">2.1. Task</a></li>
<li><a href="#org3206fd7">2.2. Requirements</a></li>
<li><a href="#org90dfd2d">2.3. Comments</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7c0a24a" class="outline-2">
<h2 id="org7c0a24a"><span class="section-number-2">1.</span> Working with Data Python</h2>
<div class="outline-text-2" id="text-1">
<p>
For a long time data handling and graph production in python lagged behind that of R. Data were collected in comma or tab separated (<a href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a>) formats or often in <a href="https://docs.python.org/3/library/pickle.html">pickle</a> files. Pickled data was textual data converted to a binary representation and had to be converted back to be read. These issues made it harder to use python in an interactive and interpreted environment for data analyis and many workers in psychology would collect their data with experiments coded in python (or other languages), and then use R as the language for statistical testing.
</p>

<p>
However, over the last few years the scientific python community has expanded its options for both graphing and data handling markedly, and working entirely in python is increasingly a viable option. The most widely used python library for handling data is <a href="https://pandas.pydata.org/">Pandas</a>. In many respects it has a similar look and feel to the <code>data.frame</code> style of data analysis used in R. However, there are definite syntactic and implementation differences. While a familiarity with R and data.frames is a good base for beginning to use Pandas there will remain a lot of concrete specfics to learn to use python effectively. In this topic a few of the pandas basics are demonstrated. In addition to the illustrations here, there are numerous online tutorials and blogs that explain pandas in more detail, and with many more examples.
</p>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705773?h=1b5d393026" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705773">Ia : Intro to Using Pandas (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>This module gives an overview of using python to request data via the internet; unzip a data file; and load that data into python with pandas for exploratory analysis.</p>
</div>

<div id="outline-container-orgb8530d4" class="outline-3">
<h3 id="orgb8530d4"><span class="section-number-3">1.1.</span> Some additional sources</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org90b4806" class="outline-4">
<h4 id="org90b4806"><span class="section-number-4">1.1.1.</span> Pandas Books</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><a href="https://www.chapters.indigo.ca/en-ca/books/python-for-data-analysis-data/9781449319793-item.html">Python for Data Analysis</a> - This book is available for online reading to University of Waterloo students.</li>
</ul>
</div>
</div>
<div id="outline-container-orgce59f2c" class="outline-4">
<h4 id="orgce59f2c"><span class="section-number-4">1.1.2.</span> Blogs</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li><a href="https://pandas.pydata.org/pandas-docs/stable/getting_started/tutorials.html">Community Tutorials</a></li>
<li><a href="https://www.learnpython.org/en/Pandas_Basics">Learn Python</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc374781" class="outline-3">
<h3 id="orgc374781"><span class="section-number-3">1.2.</span> Data handling in Python</h3>
<div class="outline-text-3" id="text-1-2">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705737?h=8f04df6247" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705737">Ib : Installing Pandas (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>There are several methods for installing Pandas. In this video I demonstrate one of the: using pip</p>
</div>
<div id="outline-container-org84db6e6" class="outline-4">
<h4 id="org84db6e6"><span class="section-number-4">1.2.1.</span> Pandas</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
How to get Pandas?
</p>
<ol class="org-ol">
<li><a href="https://docs.continuum.io/anaconda/">Anaconda</a> (Conda) - you will see this in a lot of documentation. This is a collection of packages for python that are curated to work well together and allow you to set up virutal environments (which protects your projects and their differing requirements from leading to conflicts with each other). Using <code>conda</code> is not hard, but it is another took, and it has its own learning curve, so it will not be used here. If you find yourself using python regularly and you are comfortable with how to install and use software and packages then I encourage you to read more Anaconda and decided if it is a python solution that will work for you.</li>
<li>Xubuntu stable <code>sudo apt-get install python3-pandas</code>.</li>
<li>Pip (PyPI) <code>pip3 install pandas</code></li>
</ol>

<p>
To try and get all our python packages from one source (and thereby reduce our chance for conflicts) we will use the <code>pip</code> method as that will work well with our subsequent installation of the <code>psychopy</code> package.
</p>
</div>
</div>
<div id="outline-container-org29cc7d1" class="outline-4">
<h4 id="org29cc7d1"><span class="section-number-4">1.2.2.</span> Interactve Pandas</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Python is an interpreted language. You can use Python from an interpreter much as you used R in an R console (or RStudio).
</p>
</div>
</div>
