chapters/working-with-data-in-python.org
*** Getting Your Data Into Python
#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705724?h=dc0c22cba8" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705724">Ic : Using Python to Request Data from the Internet (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>This video demonstrates some of the steps below for getting data from Python. It uses the requests library.</p>
#+end_export

     Before you can get data into python, you have to get data.

There are a large number of sources for data online that you can use to explore different tools and analyses.
     1. [[https://openpsychometrics.org/_rawdata/][Open Psychometrics]]
     2. [[https://www.apa.org/research/responsible/data-links][Data Links from the APA]]
     3. [[https://data.world/datasets/psychology][Data World]]
     4. [[https://www.kaggle.com/tags/psychology][The Kaggle Competition]]
	Kaggle competitions allow you to make data analysis a competitive sport.

For demonstration purposes we will get data from the Open Psychometrics project (I am using the humor styles questionnaire). You could just go to the website and right click and download, but you could also use python to get the data. There are many methods for this and the one used here came from this [[https://www.simplifiedpython.net/python-download-file/][online post.]]

You will have to ~pip3 install requests~ to get the requests library

Then you will want to be in the directory where you want the file to download. I am using a ~:session:~ in order to allow variables to persist across babel code blocks. 

     
     #+begin_src python :session *dataPython* 
       import requests
       url = "http://openpsychometrics.org/_rawdata/HSQ.zip"
       r = requests.get(url)
       filename = url.split('/')[-1] # -1 gets us the last item of a list, in this case the filenamel
       with open(filename,'wb') as output_file:
	   output_file.write(r.content)
     #+end_src

#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705656?h=a84dbf071f" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705656">Id : How to Use Python Unzip functions (12c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Using the python unzip library.</p>
#+end_export
     
This file is a "zip" file. For a zip file the data have been compressed to save space. There are many other compression types available. Tar is fairly common. Rar is rare. Python also has facilities to unzip files.  Why bother using all these tools rather than doing everything manually? Well, for one thing you could script it. Why waste your time clicking random buttons. Let the computer do the work. 

     #+begin_src python :session *dataPython*
       import zipfile
       with zipfile.ZipFile('./HSQ.zip', 'r') as zip_ref:
	   zip_ref.extractall('.') ; # what does "." mean in this context?
     #+end_src


#+begin_export html
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705437?h=931966f828" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705437">Ie : Getting Data into Pandas (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Reading in a csv data file to a python interactive session with Pandas.</p>
#+end_export
     
     #+begin_src python
    You have to import pandas to use it. 
    #+begin_src python :session *dataPython* :results value
      import pandas as pd
      dpd = pd.read_csv("./HSQ/data.csv")
      dpd.columns.values
    #+end_src

*** Repeating Things We Did In R With Pandas
**** The length of a list
      In R you would use the ~length~ command, but in python it is ~len~. Almost every language you will program in will have a command for finding the length, but the actual word may be different or the syntax may be different.
      
      #+begin_src python :session *dataPython* 
      len(dpd['Q1'])
      #+end_src

**** Using a Conditional
      In R we did things like ~mydataframe$mydatacol~ to get a column of data from a data frame. In python the format looks more like a python dictionary.
      
      #+begin_src python :session *dataPython*
      dpdmg = dpd.copy()
      dpdmg = dpdmg[dpdmg['gender'].isin([1,2])]
      len(dpdmg['Q1'])
      #+end_src

      What happens if you just select with ~in~? You keep the same number of rows, because you replace the ineligible data with NaNs (not a number). 

*** Functional Styles versus Object Orientation
Python is an object oriented language. R is in a more eclectic style that  reflects its LISP origins. Object oriented languages have data structures: objects, that encapsulate both attributes (what objects are like) and methods (what objects can do). A list would have its contents, the items in the list, as its attributes, but would have the ability, a method, to report the length of its /self/ [fn:4]. The attributes and methods of a python object are often accessed by a name that includes a *dot* '~.~' like the ".isin" you see in the code snippet above. Pandas creates a /data.frame object/ (the name emphasizes its R heritage), but it is not the same thing, and while most of the commands are achievable in either, they are not the same. The *dot* shows you we are accessing either an attribute or a method of an object. 

* Assessing Your Use of Pandas
** Task
  You will
  1. Download a data set in python
  2. Unzip the data set
  3. Tell me the names of all the columns
  4. Tell me the length of one of the rows
  5. And tell me the mean[fn:1] of one of the columns subset by rows[fn:2].

