book/working-with-data-in-python.html
<div id="outline-container-orgc353eda" class="outline-4">
<h4 id="orgc353eda"><span class="section-number-4">1.2.3.</span> Getting Your Data Into Python</h4>
<div class="outline-text-4" id="text-1-2-3">
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705724?h=dc0c22cba8" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705724">Ic : Using Python to Request Data from the Internet (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>This video demonstrates some of the steps below for getting day from Python. It uses the request library.</p>

<p>
Before you can get data into python, you have to get data.
</p>

<p>
There are a large number of sources for data online that you can use to explore different tools and analyses.
</p>
<ol class="org-ol">
<li><a href="https://openpsychometrics.org/_rawdata/">Open Psychometrics</a></li>
<li><a href="https://www.apa.org/research/responsible/data-links">Data Links from the APA</a></li>
<li><a href="https://data.world/datasets/psychology">Data World</a></li>
<li><a href="https://www.kaggle.com/tags/psychology">The Kaggle Competition</a>
Kaggle competitions allow you to make data analysis a competitive sport.</li>
</ol>

<p>
For demonstration purposes we will get data from the Open Psychometrics project (I am using the humor questi. You could just go to the website and right click and download, but you could also use python to get the data. There are many methods for this and the one used here came from this <a href="https://www.simplifiedpython.net/python-download-file/">online post.</a>
</p>

<p>
You will have to <code>pip3 install requests</code> to get the requests library
</p>

<p>
Then you will want to be in the directory where you want the file to download. I am using a <code>:session:</code> in order to allow variables to persist across babel code blocks. 
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> requests
<span style="color: #a0522d;">url</span> = <span style="color: #8b2252;">"http://openpsychometrics.org/_rawdata/HSQ.zip"</span>
<span style="color: #a0522d;">r</span> = requests.get(url)
<span style="color: #a0522d;">filename</span> = url.split(<span style="color: #8b2252;">'/'</span>)[-1] <span style="color: #b22222;"># </span><span style="color: #b22222;">-1 gets us the last item of a list, in this case the filenamel</span>
<span style="color: #a020f0;">with</span> <span style="color: #483d8b;">open</span>(filename,<span style="color: #8b2252;">'wb'</span>) <span style="color: #a020f0;">as</span> output_file:
    output_file.write(r.content)
</pre>
</div>

<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705656?h=a84dbf071f" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705656">Id : How to Use Python Unzip functions (12c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Using the python unzip library.</p>

<p>
This file is a "zip" file. For a zip file the data have been compressed to save space. There are many other compression types available. Tar is fairly common. Rar is rare. Python also has facilities to unzip files.  Why bother using all these tools rather than doing everything manually? Well, for one thing you could script it. Why waste your time clicking random buttons. Let the computer do the work. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a020f0;">import</span> zipfile
<span style="color: #a020f0;">with</span> zipfile.ZipFile(<span style="color: #8b2252;">'./HSQ.zip'</span>, <span style="color: #8b2252;">'r'</span>) <span style="color: #a020f0;">as</span> zip_ref:
    zip_ref.extractall(<span style="color: #8b2252;">'.'</span>) ; <span style="color: #b22222;"># </span><span style="color: #b22222;">what does "." mean in this context?</span>
</pre>
</div>


<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462705437?h=931966f828" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462705437">Ie : Getting Data into Pandas (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Reading in a csv data file to a python interactive session with Pandas.</p>

<div class="org-src-container">
<pre class="src src-python">You have to <span style="color: #a020f0;">import</span> pandas to use it. 
<span style="color: #b22222;">#</span><span style="color: #b22222;">+begin_src python :session *dataPython* :results value</span>
  <span style="color: #a020f0;">import</span> pandas <span style="color: #a020f0;">as</span> pd
  <span style="color: #a0522d;">dpd</span> = pd.read_csv(<span style="color: #8b2252;">"./HSQ/data.csv"</span>)
  dpd.columns.values
</pre>
</div>
</div>
</div>

<div id="outline-container-org348ea0f" class="outline-4">
<h4 id="org348ea0f"><span class="section-number-4">1.2.4.</span> Repeating Things We Did In R With Pandas</h4>
<div class="outline-text-4" id="text-1-2-4">
</div>
<ol class="org-ol">
<li><a id="org1a65179"></a>The length of a list<br />
<div class="outline-text-5" id="text-1-2-4-1">
<p>
In R you would use the <code>length</code> command, but in python it is <code>len</code>. Almost every language you will program in will have a command for finding the length, but the actual word may different or the syntax may be different.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #483d8b;">len</span>(dpd[<span style="color: #8b2252;">'Q1'</span>])
</pre>
</div>
</div>
</li>

<li><a id="org2e223fa"></a>Using a Conditional<br />
<div class="outline-text-5" id="text-1-2-4-2">
<p>
In R we did things like <code>mydataframe$mydatacol</code> to get a column of data from a data frame. In python the format looks more like a python dictionary.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #a0522d;">dpdmg</span> = dpd.copy()
<span style="color: #a0522d;">dpdmg</span> = dpdmg[dpdmg[<span style="color: #8b2252;">'gender'</span>].isin([1,2])]
<span style="color: #483d8b;">len</span>(dpdmg[<span style="color: #8b2252;">'Q1'</span>])
</pre>
</div>

<p>
What happens if you just select with <code>in</code>? You keep the same number of rows, because you replace the ineligible data with NaNs (not a number). 
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5b2e734" class="outline-4">
<h4 id="org5b2e734"><span class="section-number-4">1.2.5.</span> Functional Styles versus Object Orientation</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Python is an object oriented language. R is in a more eclectic style that  reflects its LISP origins. Object oriented languages have data structures: objects, that encapsulate both attributes (what objects are like) and methods (what objects can do). A list would have its contents, the items in the list, as its attributes, but would have the ability, a method, to report the length of its <i>self</i> <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. The attributes and methods of a python object are often accessed by a name that includes a <b>dot</b> '<code>.</code>' like the ".isin" you see in the code snippet above. Pandas creates a <i>data.frame object</i> (the name emphasizes its R heritage), but it is not the same thing, and while most of the commands are achievable in either, they are not the same. The <b>dot</b> shows you we are accessing either an attribute or a method of an object. 
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd83dee9" class="outline-2">
<h2 id="orgd83dee9"><span class="section-number-2">2.</span> Assessing Your Use of Pandas</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga5e6c87" class="outline-3">
<h3 id="orga5e6c87"><span class="section-number-3">2.1.</span> Task</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You will
</p>
<ol class="org-ol">
<li>Download a data set in python</li>
<li>Unzip the data set</li>
<li>Tell me the names of all the columns</li>
<li>Tell me the length of one of the rows</li>
<li>And tell me the mean<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> of one of the columns subset by rows<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>.</li>
</ol>
</div>
</div>
