book/working-with-data-in-python.html

<div id="outline-container-org3206fd7" class="outline-3">
<h3 id="org3206fd7"><span class="section-number-3">2.2.</span> Requirements</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Your submission will be either an org<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> file with code blocks that let me execute each of these steps by myself interactively one at a time. Or a python script that I can run from the command line and that will perform each of these functions displaying its output to <code>stdout</code>. Stdout is the linux name for printing to the screen in the terminal. For example, when you do <code>ls</code> to list the names of files in a directory you are directing to stdout. 
</p>
</div>
</div>

<div id="outline-container-org90dfd2d" class="outline-3">
<h3 id="org90dfd2d"><span class="section-number-3">2.3.</span> Comments</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Don't start by writing this as a script. That will almost certainly be too hard. Begin by doing this interactively, perhaps at a python interpreter until you get the code for a particular step done corrrectly. Then copy that code to your file and and test that it still works; that something did not get messed up in the copying and pasting.
Once you have the data in your interpreter, don't just rush through. Take some time to play with various pandas commands or exercises such as examples you can find <a href="https://www.w3resource.com/python-exercises/pandas/index-data-series.php">here</a> to generally grow more familiar with the package.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Self is in italics because this is the special name one often sees in object oriented code were the definition of an object is given. Self typically refers to the particular instance of an object as it is being made. 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Or some other simple statistic appropriate to the data, e.g. if your data was <i>categorical</i> you might give me the number of rows for each type of category.  
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
An example of this is that if you had columns for heights and genders you could output the average height of men, women, and other. 
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
To make some nicer formatting and help available when using python from within emacs checkout the <code>elpy</code> <a href="https://elpy.readthedocs.io/en/latest/introduction.html#installation">package</a>.
</p>
<div style="padding:56.39% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/462706049?h=3d1ebf93de" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/462706049">Ec : Installing the Elpy package (i2c4p)</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>Installing the elpy package. A bit about installing packages in emacs generally, and a specific package to help with python code formatting and syntax.</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-09 Thu 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-02-14 Tue 05:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>